##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [2]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인
import numpy as np
import pandas as pd

titanic = pd.read_csv('./data/titanic.csv')

titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Passe258gerId  891 non-null    int64
 1   Survived       891 non-null    int64
 2   Pclass         891 non-null    int64
 3   Name           891 non-null    object
 4   Sex            891 non-null    object
 5   Age            714 non-null    float64
 6   SibSp          891 non-null    int64
 7   Parch          891 non-null    int64
 8   Ticket         891 non-null    object
 9   Fare           891 non-null    float64
 10  Cabin          204 non-null    object
 11  Embarked       889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
titanic

,Passe258gerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
titanic.describe(include='all')

,Passe258gerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Dooley, Mr. Patrick",male,NaN,NaN,NaN,347082,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

- 기초문제

In [5]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
counts = titanic['Survived'].value_counts()

print(f'생존자 수: {counts[1]}')
print(f'사망자 수: {counts[0]}')

생존자 수: 342
사망자 수: 549

In [6]:
# 2. 승객 나이의 평균 출력
avg_age = titanic['Age'].mean()

print(f'평균 나이: {avg_age:.2f}')

평균 나이: 29.70

In [7]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
max_fare = titanic['Fare'].max()

name = titanic[(titanic['Pclass'] == 1) & (titanic['Fare'] == max_fare)]['Name']

for i, name in enumerate(name):
    print(f'승객{i+1}: {name}')

승객1: Ward, Miss. Anna
승객2: Cardeza, Mr. Thomas Drake Martinez
승객3: Lesurer, Mr. Gustave J

In [8]:
# 4. 여성 승객의 수를 구하여 출력
fem_pass = len(titanic[titanic['Sex'] == 'female'])
print(f'여성 승객 수: {fem_pass}명')

여성 승객 수: 314명

In [9]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
names_fares = titanic[titanic['Fare'] >= 50][['Name', 'Fare']]

print(names_fares)

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [41]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
# 생존율 = 생존 인원 / 총 인원 * 100

# 18세 미만인 승객들 중 생존자 구하기
under_18_sur = len(titanic[(titanic['Age'] < 18) & (titanic['Survived'] == 1)])

# 18세 미만인 승객들의 18세 미만 승객 중 생존율
under_18_tot = len(titanic[titanic['Age'] < 18])
survival_rate_under_18 = under_18_sur / under_18_tot * 100
print(f'18세 미만 승객 중 18세 미만 승객 생존율: {survival_rate_under_18:.2f}%')

# 18세 미만인 승객들의 전체 승객 중 생존율
tot_pass = len(titanic)
survival_rate = under_18_sur / tot_pass * 100
print(f'전체 승객 중 18세 미만 승객 생존율: {survival_rate:.2f}%')

18세 미만 승객 중 18세 미만 승객 생존율: 53.98%
전체 승객 중 18세 미만 승객 생존율: 6.85%

In [37]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
fares = titanic[titanic['Pclass'] == 2]['Fare']
print(f'평균 운임: {fares.mean():.2f}')

평균 운임: 20.66

In [13]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
oldest = titanic['Age'].max()
oldest_pass = titanic[titanic['Age'] == oldest][['Name', 'Age']]

print(oldest_pass)

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [13]:
# 9. S 항구에서 탑승한 승객의 수를 출력
s_pier = len(titanic[titanic['Embarked'] == 'S'])
print(f'S항구 탑승 승객 수: {s_pier}명')

S항구 탑승 승객 수: 644명

In [14]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
class_3rd_surv = len(titanic[(titanic['Pclass'] == 3) & (titanic['Survived'] == 1)])
print(f'3등급 객실 남성 생존자 수: {class_3rd_surv}명')

3등급 객실 남성 생존자 수: 119명

- 고급문제

In [42]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
# 객실 등급 별 생존자/사망자 구하기
fir_surv = titanic[(titanic['Survived'] == 1) & (titanic['Pclass'] == 1)]
fir_not_surv = titanic[(titanic['Survived'] == 0) & (titanic['Pclass'] == 1)]

sec_surv = titanic[(titanic['Survived'] == 1) & (titanic['Pclass'] == 2)]
sec_not_surv = titanic[(titanic['Survived'] == 0) & (titanic['Pclass'] == 2)]

thir_surv = titanic[(titanic['Survived'] == 1) & (titanic['Pclass'] == 3)]
thir_not_surv = titanic[(titanic['Survived'] == 0) & (titanic['Pclass'] == 3)]

# 생존자/사망자,  등급별(1, 2, 3) = 평균나이 구하기기
fs_avg_age = fir_surv['Age'].mean()
fn_avg_age = fir_not_surv['Age'].mean()

ss_avg_age = sec_surv['Age'].mean()
sn_avg_age = sec_not_surv['Age'].mean()

ts_avg_age = thir_surv['Age'].mean()
tn_avg_age = thir_not_surv['Age'].mean()


# 평균 나이 출력
print(f'1등급 생존자 평균 나이: {fs_avg_age:.2f}세')
print(f'1등급 사망자 평균 나이: {fn_avg_age:.2f}세')

print(f'2등급 생존자 평균 나이: {ss_avg_age:.2f}세')
print(f'2등급 사망자 평균 나이: {sn_avg_age:.2f}세')

print(f'3등급 생존자 평균 나이: {ts_avg_age:.2f}세')
print(f'3등급 사망자 평균 나이: {tn_avg_age:.2f}세')

1등급 생존자 평균 나이: 35.37세
1등급 사망자 평균 나이: 43.70세
2등급 생존자 평균 나이: 25.90세
2등급 사망자 평균 나이: 33.54세
3등급 생존자 평균 나이: 20.65세
3등급 사망자 평균 나이: 26.56세

In [16]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
# SibSp가 3 이상인 승객들을 운임 순으로 정렬
names_ages = titanic[titanic['SibSp'] >= 3][['Name', 'Age', 'Fare', 'SibSp']]
sort_fares = names_ages.sort_values(by='Fare', ascending=False)

# 상위 5명의 이름과 나이 출력
top_5 = sort_fares.head(5)[['Name', 'Age']]
print(top_5)

                               Name   Age
27   Fortune, Mr. Charles Alexander  19.0
88       Fortune, Miss. Mabel Helen  23.0
341  Fortune, Miss. Alice Elizabeth  24.0
159      Sage, Master. Thomas Henry   NaN
180    Sage, Miss. Constance Gladys   NaN

In [43]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

null_age = titanic[titanic['Age'].isnull()]
null_age['Embarked'].value_counts()

Embarked
S    90
Q    49
C    38
Name: count, dtype: int64

In [36]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

passengers = titanic[(titanic['Age'] <= 16) & (titanic['SibSp'] == 0) & (titanic['Parch'] == 0)][['Name', 'Sex', 'Survived']]
print(passengers)

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
138                   Osen, Mr. Olaf Elon    male         0
156      Gilnagh, Miss. Katherine "Katie"  female         1
208             Carr, Miss. Helen "Ellen"  female         1
220        Sunderland, Mr. Victor Francis    male         1
282             de Pelsmaeker, Mr. Alfons    male         0
504                 Maioni, Miss. Roberta  female         1
574          Rush, Mr. Alfred George John    male         0
731              Hassan, Mr. Houssein G N    male         0
764                Eklund, Mr. Hans Linus    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
791                   Gaskell, Mr. Alfred    male         0
841              Mudd, Mr. Thomas Charles    male         0
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [37]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
# 평균 운임 구하기
mean_fare = titanic['Fare'].mean()

# 평균 운임보다 높은 사람들의 이름, 나이, 운임 출력
high_fares = titanic[(titanic['Pclass'] == 1) & (titanic['Fare'] > mean_fare)][['Name', 'Age', 'Fare']]
print(high_fares)

                                                  Name   Age      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   53.1000
6                              McCarthy, Mr. Timothy J  54.0   51.8625
23                        Sloper, Mr. William Thompson  28.0   35.5000
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
..                                                 ...   ...       ...
853                          Lines, Miss. Mary Conover  16.0   39.4000
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667
867               Roebling, Mr. Washington Augustus II  31.0   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0   83.1583

[159 rows x 3 columns]

In [45]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
filtered_data = titanic.dropna(subset=['Age', 'Pclass', 'Fare'])
result = filtered_data.groupby('Pclass')["Fare"].agg(['mean', 'median'])

print(result)

             mean   median
Pclass
1       87.961582  69.3000
2       21.471556  15.0458
3       13.229435   8.0500

In [48]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
# 'Embarked'별 평균 나이
ages = titanic.groupby('Embarked')['Age'].mean()
print(ages)


# 가장 많은 승객이 탑승한 항구 구하기
most_embarked = titanic['Embarked'].value_counts().idxmax()
most_embarked

# S항구 생존자 인원 구하기
spier_surv = len(titanic[(titanic['Embarked'] == 'S') & titanic['Survived'] == 1])

# 생존율 구하기
spier_surv_rate = spier_surv / len(titanic) * 100
print(f'S항구 생존율: {spier_surv_rate:.2f}%')

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
S항구 생존율: 24.35%

In [33]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력
# 총 승객 수
total_pass = len(titanic)

# 여성이면서 30세 이상인 승객 수
over_30_fem = titanic[(titanic['Sex'] == 'female') & (titanic['Age'] >= 30)]
fem_pass = len(over_30_fem)

fem_survival_rate = fem_pass / total_pass * 100
print(f' 30세 이상 여성 생존율: {fem_survival_rate:.2f}%')

 30세 이상 여성 생존율: 12.79%

In [32]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

over_three = titanic[(titanic['SibSp'] + titanic['Parch']) >= 3]

surv = over_three['Survived'] == 1

surv_rate = len(surv) / len(titanic) * 100

print(f'생존율: {surv_rate:.2f}%')

생존율: 10.21%

In [53]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력

# # 객실번호 null값 drop
# cabin = titanic.dropna(subset=['Cabin'])

# # 객실 등급별 생존자 인원
# cabin_surv = titanic[(titanic['Cabin'] == cabin) & (titanic['Survived'] == 1)]


# 'Cabin' 정보가 있는 승객
cabin = titanic.dropna(subset=['Cabin'])

# 객실 등급 가져오기
cabin['CabinClass'] = cabin['Cabin'].str[0]

# 객실 등급별로 생존율 계산
surv_by_cabin_class = cabin.groupby('CabinClass')['Survived'].mean()
print(surv_by_cabin_class)

CabinClass
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
Name: Survived, dtype: float64

C:\Users\Playdata\AppData\Local\Temp\ipykernel_37088\3478168665.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cabin['CabinClass'] = cabin['Cabin'].str[0]